// Написати функцію median, яка приймає масив і знаходить його медіану.
// Медіана - це центральна статистика положення, яка розділяє розподіл на дві частини, тобто вона залишає таку ж
// кількість значень на одній стороні, як і на іншій.
// У масиві з непарним числом елементів медіана це число всередині масиву.
// Для масиву з парним числом елементів, де немає жодного елемента точно посередині,
// медіана – це середнє значення двох чисел, що знаходяться всередині масиву.
// У цій задачі заданий непустий масив натуральних чисел. Вам потрібно знайти медіану цього масиву.

// median([1, 2, 3, 4, 5]) // 3
// median([3, 6, 10, 15, 20, 99]) // 12.5