// TODO list 

// Існує форма з одним інпутом, куди вводиться текст. І є чекбокс.
//    Поки чекбокс не натиснутий, кнопка на формі неактивна.
//    Натисканням Enter в інпуті або натисканням на кнопку Add, в список нижче, додається todo-нотатка.
//    Очистити інпут
//    Прибрати перезавантаження, звертатися через форму (elements) та ім'я інпуту
//    При натисканні на todo-замітку у списку, вона стає виконаною, тобто. текст закреслюється (клас complete)
//    Чекбокс при додаванні нотатки знову має стати не вибраним, а кнопка знову недоступною
//    Додати кнопку Видалити на кожну нотатку (+функціонал видалення)