// Використовуючи prompt задайте питання, на яке можна відповісти "так" чи "ні"
// Випадкове число для відповіді генерується функцією Math.floor(Math.random() * 5)
// Використовуйте switch для створення випадкових відповідей, де:
// 0 - 'Все будет ОК'
// 1 - 'Може так, а може ні'
// 2 - 'Певно, ні'
// 3 - 'Дуже ймовірно'
// def - 'Я нічого про це не знаю'
// Вивести відповідь із запитанням ("Поставлене запитання - question.
//  Шар думає, що - answer")

const askUser = prompt('ask');

function answerUser() {
  switch (Math.floor(Math.random() * 5)) {
    case 0:
      return 'Все будет ОК';

    case 1:
      return 'Може так, а може ні';

    case 2:
      return 'Певно, ні';

    case 3:
      return 'Дуже ймовірно';

    default:
      return 'Я нічого про це не знаю';
  }
}

console.log(
  `Поставлене запитання - ${askUser}. Шар думає, що - ${answerUser()}`
);
